<template>
  <div class="services">
    <div class="services__container">
      <h1 class="title">Услуги</h1>
      <div class="services__container-cards">
        <div class="services__container-cards-card" v-for="service in services" :key="service">
            <h1>{{ service.title }}</h1>
            <p>{{ service.shortTitle }}</p>
            <span>{{ service.desc }}</span>
            <div>
                <span>{{ service.price }}</span>
                <button class="black-button">Заказать</button>
            </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      services: [
        {
          title: "Планировочное решение",
          shortTitle:
            "Вам необходима удобная планировка помещения и расположение мебели.",
          desc: "Выезд на замер и фотофиксация Разработка планировочного решения (три варианта) План сносимых и возводимых перегородок",
          price: "от 20 000 ₽",
        },
        {
          title: "Полный дизайн-проект",
          shortTitle:"Вы хотите полноценный дизайн-проект с 3D-визуализацией и проработкой каждой детали.",
          desc: "Выезд на замер и фотофиксация Составление подробного технического задания      на проект Разработка планировочного решения (три варианта) Пространственное 3D-моделирование планировочного решения Составление бюджета на отделочные материалы    по проекту Концептуальные коллажи будущего интерьера      (два варианта на помещение) Фотореалистичная 3D-визуализация с подобранными реальными отделочными материалами Комплект рабочей документации для строителей Спецификация отделочных материалов, света, сантехники и мебели",
          price: "2500 ₽/м2 ",
        },
        {
          title: "Ускоренный дизайн-проект",
          shortTitle:
            "У вас ограничены сроки для разработки дизайн-проекта",
          desc: "Выезд на замер и фотофиксация Составление подробного технического задания      на проект Разработка планировочного решения (три варианта) Составление бюджета на отделочные материалы    по проекту Дизайн-концепция (коллажи будущего интерьера)  Комплект рабочей документации для строителей Спецификация отделочных материалов, света, сантехники и мебели",
          price: "2500 ₽/м2 ",
        },
        {
          title: "Планировочное решение",
          shortTitle:
            "Вам необходима удобная планировка помещения и расположение мебели.",
          desc: "Выезд на замер и фотофиксация Разработка планировочного решения (три варианта) План сносимых и возводимых перегородок",
          price: "от 20 000 ₽",
        },
        {
          title: "Авторский надзор",
          shortTitle:
            "Вы делегируете нам контроль за реализацией дизайн-проекта. Мы можем гарантировать, что реализованный интерьер будет в точности соответствовать визуализациям только при условии авторского надзора специалистами студии.",
          desc: "Плановый выезд на объект до 4-х раз в месяц  Контроль проводимых работ в соответствии с дизайн-проектом Актуализация рабочих чертежей Выезды в салоны и магазины, согласование с заказчиком счётов на закупку и доставку материалов Контроль заказа отделочных материалов, освещения, сантехники и мебели на объект Подбор альтернативных отделочных материалов или мебели в случае замены",
          price: "25 000 ₽/месяц",
        },
        {
          title: "Реализация проекта под ключ",
          shortTitle:
            "От идеи до финальной реализации. Привлекаем бригаду проверенных строителей для реализации дизайн-проекта. Вы платите только за услугу дизайн-проект и по завершению строительных работ въезжаете в полностью готовую квартиру.",
          price: "от 1800 ₽/м2 ",
        },
      ],
    };
  },
};
</script>

<style lang="scss">
.services {
margin-top: 8rem;
  &__container {
    max-width: 1300px;
    margin: 0 auto;
    widows: 100%;
    color: rgba(0, 0, 0, 1);
    &-cards{
        display: flex;
        flex-wrap: wrap;
        justify-content: space-between;
        row-gap: 3rem;
        margin-top: 3rem;
        &-card{
            background: rgba(241, 239, 233, 1);
            width: 420px;
            padding: 1.5rem;
            h1{
                font-weight: 400;
                font-size: 1.5rem;
            }
            p{
                margin-top: 2rem;
                font-weight: 300;
                font-size: 1.2rem;
            }
            span{
                margin-top: 2rem;
                font-weight: 300;
                font-size: 1rem;
            }
            div{
                display: flex;
                justify-content: space-between;
                align-items: center;
            
                span{
                    font-size: 1.5rem;
                }
            }
        }
    }
  }
}
</style>